---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelConnectedLabel
source: html/4b4f489c-273a-cefd-dbca-10fc55710fad.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelConnectedLabel Property

The name template for the connected load parameter of the load classification.

## Syntax (C#)
```csharp
public string PanelConnectedLabel { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: panelConnectedLabel is not a valid globalization format string.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null